let newsList = [
    {
        "newsId": "#",
        "news_content": {
                "title": "Посвящение в архивисты молодых специалистов 2024 г.",
                "text": "29 августа 2024 г. в Национальном архиве Республики Беларуси (далее — НАРБ) состоялось торжественное мероприятие — посвящение в архивисты молодых специалистов 2024 года выпуска. В республиканские архивные учреждения пришли на работу 28 выпускников высших учебных заведений, которые приступили к работе в должностях архивистов, научных сотрудников и инженеров-программистов.",
                "date": "30.08.2024",
                "img_src": "../images/newsImage_1.png"
            }
    },
    {
        "newsId": "#",
        "news_content": {
                "title": "Посвящение в архивисты молодых специалистов 2024 г.",
                "text": "29 августа 2024 г. в Национальном архиве Республики Беларуси (далее — НАРБ) состоялось торжественное мероприятие — посвящение в архивисты молодых специалистов 2024 года выпуска. В республиканские архивные учреждения пришли на работу 28 выпускников высших учебных заведений, которые приступили к работе в должностях архивистов, научных сотрудников и инженеров-программистов.",
                "date": "30.08.2024",
                "img_src": "../images/newsImage_1.png"
            }
    },
    {
        "newsId": "#",
        "news_content": {
                "title": "Посвящение в архивисты молодых специалистов 2024 г.",
                "text": "29 августа 2024 г. в Национальном архиве Республики Беларуси (далее — НАРБ) состоялось торжественное мероприятие — посвящение в архивисты молодых специалистов 2024 года выпуска. В республиканские архивные учреждения пришли на работу 28 выпускников высших учебных заведений, которые приступили к работе в должностях архивистов, научных сотрудников и инженеров-программистов.",
                "date": "30.08.2024",
                "img_src": "../images/newsImage_1.png"
            }
    },
    {
        "newsId": "#",
        "news_content": {
                "title": "Посвящение в архивисты молодых специалистов 2024 г.",
                "text": "29 августа 2024 г. в Национальном архиве Республики Беларуси (далее — НАРБ) состоялось торжественное мероприятие — посвящение в архивисты молодых специалистов 2024 года выпуска. В республиканские архивные учреждения пришли на работу 28 выпускников высших учебных заведений, которые приступили к работе в должностях архивистов, научных сотрудников и инженеров-программистов.",
                "date": "30.08.2024",
                "img_src": "../images/newsImage_1.png"
            }
    },
    {
        "newsId": "#",
        "news_content": {
                "title": "Посвящение в архивисты молодых специалистов 2024 г.",
                "text": "29 августа 2024 г. в Национальном архиве Республики Беларуси (далее — НАРБ) состоялось торжественное мероприятие — посвящение в архивисты молодых специалистов 2024 года выпуска. В республиканские архивные учреждения пришли на работу 28 выпускников высших учебных заведений, которые приступили к работе в должностях архивистов, научных сотрудников и инженеров-программистов.",
                "date": "30.08.2024",
                "img_src": "../images/newsImage_1.png"
            }
    },
    {
        "newsId": "#",
        "news_content": {
                "title": "Посвящение в архивисты молодых специалистов 2024 г.",
                "text": "29 августа 2024 г. в Национальном архиве Республики Беларуси (далее — НАРБ) состоялось торжественное мероприятие — посвящение в архивисты молодых специалистов 2024 года выпуска. В республиканские архивные учреждения пришли на работу 28 выпускников высших учебных заведений, которые приступили к работе в должностях архивистов, научных сотрудников и инженеров-программистов.",
                "date": "30.08.2024",
                "img_src": "../images/newsImage_1.png"
            }
    },
    {
        "newsId": "#",
        "news_content": {
                "title": "Посвящение в архивисты молодых специалистов 2024 г.",
                "text": "29 августа 2024 г. в Национальном архиве Республики Беларуси (далее — НАРБ) состоялось торжественное мероприятие — посвящение в архивисты молодых специалистов 2024 года выпуска. В республиканские архивные учреждения пришли на работу 28 выпускников высших учебных заведений, которые приступили к работе в должностях архивистов, научных сотрудников и инженеров-программистов.",
                "date": "30.08.2024",
                "img_src": "../images/newsImage_1.png"
            }
    },
    {
        "newsId": "#",
        "news_content": {
                "title": "Посвящение в архивисты молодых специалистов 2024 г.",
                "text": "29 августа 2024 г. в Национальном архиве Республики Беларуси (далее — НАРБ) состоялось торжественное мероприятие — посвящение в архивисты молодых специалистов 2024 года выпуска. В республиканские архивные учреждения пришли на работу 28 выпускников высших учебных заведений, которые приступили к работе в должностях архивистов, научных сотрудников и инженеров-программистов.",
                "date": "30.08.2024",
                "img_src": "../images/newsImage_1.png"
            }
    },
    {
        "newsId": "#",
        "news_content": {
                "title": "Посвящение в архивисты молодых специалистов 2024 г.",
                "text": "29 августа 2024 г. в Национальном архиве Республики Беларуси (далее — НАРБ) состоялось торжественное мероприятие — посвящение в архивисты молодых специалистов 2024 года выпуска. В республиканские архивные учреждения пришли на работу 28 выпускников высших учебных заведений, которые приступили к работе в должностях архивистов, научных сотрудников и инженеров-программистов.",
                "date": "30.08.2024",
                "img_src": "../images/newsImage_1.png"
            }
    },
    {
        "newsId": "#",
        "news_content": {
                "title": "Посвящение в архивисты молодых специалистов 2024 г.",
                "text": "29 августа 2024 г. в Национальном архиве Республики Беларуси (далее — НАРБ) состоялось торжественное мероприятие — посвящение в архивисты молодых специалистов 2024 года выпуска. В республиканские архивные учреждения пришли на работу 28 выпускников высших учебных заведений, которые приступили к работе в должностях архивистов, научных сотрудников и инженеров-программистов.",
                "date": "30.08.2024",
                "img_src": "../images/newsImage_1.png"
            }
    },
    {
        "newsId": "#",
        "news_content": {
                "title": "Посвящение в архивисты молодых специалистов 2024 г.",
                "text": "29 августа 2024 г. в Национальном архиве Республики Беларуси (далее — НАРБ) состоялось торжественное мероприятие — посвящение в архивисты молодых специалистов 2024 года выпуска. В республиканские архивные учреждения пришли на работу 28 выпускников высших учебных заведений, которые приступили к работе в должностях архивистов, научных сотрудников и инженеров-программистов.",
                "date": "30.08.2024",
                "img_src": "../images/newsImage_1.png"
            }
    },
    {
        "newsId": "#",
        "news_content": {
                "title": "Посвящение в архивисты молодых специалистов 2024 г.",
                "text": "29 августа 2024 г. в Национальном архиве Республики Беларуси (далее — НАРБ) состоялось торжественное мероприятие — посвящение в архивисты молодых специалистов 2024 года выпуска. В республиканские архивные учреждения пришли на работу 28 выпускников высших учебных заведений, которые приступили к работе в должностях архивистов, научных сотрудников и инженеров-программистов.",
                "date": "30.08.2024",
                "img_src": "../images/newsImage_1.png"
            }
    },
    {
        "newsId": "#",
        "news_content": {
                "title": "Посвящение в архивисты молодых специалистов 2024 г.",
                "text": "29 августа 2024 г. в Национальном архиве Республики Беларуси (далее — НАРБ) состоялось торжественное мероприятие — посвящение в архивисты молодых специалистов 2024 года выпуска. В республиканские архивные учреждения пришли на работу 28 выпускников высших учебных заведений, которые приступили к работе в должностях архивистов, научных сотрудников и инженеров-программистов.",
                "date": "30.08.2024",
                "img_src": "../images/newsImage_1.png"
            }
    }
]




$(document).ready(function(){

    newsContainer = $("#newsContainer");

    let newsViewCount = newsList.length

    if (newsViewCount > 30) {newsViewCount = 30}


    for (let i = 0; i < newsViewCount; i++) {

        let newsDict = newsList[i]
        let content = newsDict["news_content"]

        newsCard = "<a href=" + newsDict["newsId"] + " class='newsItem'>" +
                        "<img src=" + content["img_src"] + " alt='image' class='newsItemImage spanR_2'>" +
                        "<h5 class='newsItemTitle'>" + content["title"] + "</h5>" +
                        "<p class='newsItemDate fontSize_06'>" + content["date"] + "</p>" +
                        "<p class='newsItemText fontSize_08 spanC_2'>" + content["text"] + "</p>" +
                    "</a>"

        newsContainer.append(newsCard)
    }

});



